{
  "id": "https://nva.sikt.no/terms/2024-10-01",
  "validFrom": "2024-10-01T12:00:00",
  "agreement": "SOFTWARE LICENSE AGREEMENT\nTHIS SOFTWARE LICENSE AGREEMENT IS A LEGAL AGREEMENT BETWEEN YOU, EITHER A SINGLE INDIVIDUAL, ENTITY\nOR GOVERNMENT ORGANIZATION AND EMBARCADERO TECHNOLOGIES, INC. AND ITS AFFILIATES FOR THE SOFTWARE\nYOU ARE LICENSING. CAREFULLY READ THIS AGREEMENT BEFORE YOU INSTALL OR USE THE SOFTWARE. BY\nINSTALLING OR USING THE SOFTWARE OR BY CLICKING ON “ACCEPT” YOU AGREE TO BE BOUND BY THE TERMS OF\nTHIS AGREEMENT AND YOU REPRESENT THAT YOU HAVE THE AUTHORITY TO ENTER INTO THIS AGREEMENT. ALL\nSOFTWARE ORDERED THROUGH AN AUTHORIZED RESELLER OR DISTRIBUTOR IS GOVERNED BY THIS AGREEMENT. IF\nYOU DO NOT HAVE THE AUTHORITY TO ENTER INTO THIS AGREEMENT, OR IF YOU DO NOT AGREE TO THE TERMS OF\nTHIS AGREEMENT, YOU MUST NOT INSTALL OR USE THE SOFTWARE. THIS AGREEMENT, SHALL GOVERN YOUR\nINSTALLATION AND USE OF THE PRODUCTS UPON THE EARLIER OF YOUR AGREEMENT TO PURCHASE A LICENSE FOR\nSUCH PRODUCTS OR YOUR INSTALLATION OR USE OF THE PRODUCTS.\nTHIS SOFTWARE LICENSE AGREEMENT (this “Agreement”), dated as of the date of your purchase or receipt of a license to use the\nSoftware, is between Embarcadero Technologies, Inc., a Delaware corporation (“Licensor”) and the customer set forth on the Order\nForm pursuant to which the licenses for the Software were purchased (“you” or “Licensee”), and sets forth the terms and conditions\nwhereby Licensor agrees to provide to you and you agree to acquire from Licensor one or more licenses to use certain software,\ndocumentation and maintenance services related thereto, owned or licensed by Licensor, as set forth on the applicable Order Forms\ndelivered in connection with this Agreement. To the extent any terms or conditions contained in the Order Form conflict with the terms\nor conditions contained in this Agreement, the terms and conditions of the Order Form shall supersede only those conflicting terms or\nconditions contained in this Agreement and only to the minimum extent necessary to harmonize the terms in such Order Form with the\nterms contained herein. The Order Form together with the terms and conditions of this Agreement, shall constitute and be construed as\na single agreement consisting of the terms and conditions contained in the Order Form together with the terms of this Agreement. This\nAgreement specifically supersedes and replaces the terms and conditions of all prior agreements between Licensor and you, including,\nbut not limited to, any demo or trial agreements which may accompany or are embedded in Licensor’s products or which have been\npreviously in force between the parties. In consideration of the mutual promises and agreements contained herein, the parties hereto\nalso agree as follows:\n1. DEFINED TERMS.\na. \"Affiliate\" means an entity that owns or controls, is owned or controlled by, or is under common control or ownership with\na Party, where \"control\" is the possession, directly or indirectly, of the power to direct or cause the direction of the management and\npolicies of an entity, whether through ownership of voting securities, by contract or otherwise.\nb. “Application” means any application, program or other software that Licensee develops using the Software.\nc. “Desktop/Workstation” means a single physical machine, including but not limited to a personal computer, workstation,\nlaptop computer, desktop computer or mobile device, specifically excluding a Server, on which the Software is loaded or executed, that\nis operated, either attended or via remote access, by one person at a time, and cannot be used by more than one person, directly or\nindirectly, simultaneously.\nd. “Developer” means any named identifiable individual person, not necessarily named at the time of a license grant,\nregardless of whether or not the individual is actively using the Software at any given time, designated by Licensee to do any of the\nfollowing: (A) build, compile, assemble, test or otherwise cause to be executed any application programs that rely on the Software as a\ncomponent; (B) use or execute any Software programs for development, testing, or support purposes; (C) package or otherwise\nprepare Software components for redistribution as part of another program or application; or (D) have possession of any Software\nresources or files for any purposes other than archiving.\ne. “Intellectual Property” means any and all tangible and intangible: (A) rights associated with works of authorship\nthroughout the world, including but not limited to copyrights, neighboring rights, moral rights, and mask works, and all derivative works\nthereof; (B) trademark and trade name rights and similar rights; (C) trade secret rights; (D) patents, designs, algorithms and other\nindustrial property rights; (E) intellectual and industrial property rights (of every kind and nature throughout the world and however\ndesignated) whether arising by operation of law, contract, license, or otherwise, not otherwise described herein; and (F) registrations,\ninitial applications, renewals, extensions, continuations, divisions or reissues thereof now or hereafter in force (including any rights in\nany of the foregoing).\nf. \"Machine\" means an attended or remotely controlled desktop, workstation or computer where the Software is loaded, that\nis operated by no more than one person at a time.\ng. “New Release” means new releases of the Software where the number to the left of the first “.” in the product designation\nis changed by Licensor (e.g. “16.0.6360.0” is changed to “17.0.6360.0”).\nh. “Non-Commercial” means any use of the Software which (A) is not undertaken for profit; (B) is not intended to produce\nsoftware, works, services, or data for commercial use; or (C) is neither conducted, nor funded, by a person or an entity engaged in the\ncommercial use, application, development or exploitation of works similar to the Software.\ni. “Non-Production\" means a non-operational environment into which the Software may be installed, which is not\nprocessing live data, which is not running any operations of the Licensee and which has not been deployed to permit any users to\naccess live data. Non-Production environments include development and test environments.\n\nPage 2 of 6\nVer. 081017ns\nj. “Order Form” means any of the following (A) online purchase transaction from the Licensor’s website; (B) a purchase\norder or other written order form from you and accepted by Licensor in e-mail confirmation or by releasing Product Keys to you; (C) a\nquotation issued by Licensor and signed by you; (D) any document accepted by and between a Licensor reseller or distributor pursuant\nto which you may order Software from Licensor; (E) an invoice issued by Licensor; or (F) any other document that references this EULA\nand is agreed to by Licensor in writing. All Order Forms are incorporated herein and governed by this Agreement.\nk. “Production\" means an operational environment into which the Software has been installed, which is processing live data\nand which has been deployed so that the intended users of the environment are able to access the live data. Production environments\ninclude quality assurance, disaster recovery, failover, and high availability environments.\nl. “Software” means the specific version of the Licensor proprietary software product for which you are granted a Product\nKey, in object code form only, licensed to you under this Agreement, including all documentation, Updates and all copies made by you.\nm. “Server” means a physical or virtual machine which has a server operating system and/or where more than one person\ncan simultaneously use the computer either by direct or remote access.\nn. “Update” collectively means all successor upgrades, revisions, patches, enhancements, fixes, modifications, additions or\nmaintenance releases of the Software where any number to the right of the first “.” in the product designation is changed by Licensor\n(e.g. “16.0.6355.0” is changed to “16.0.6360.0), if any, licensed to you by the Licensor but does not include New Releases unless you\npurchase a subscription license.\no. \"Use\" means to run, view, print, update, utilize, access, download, store, load, install, execute, display, or copy the\nSoftware into the memory of a computer or otherwise benefit from using the functionality of the Software in accordance with its\ndocumentation.\np. “User” means any named identifiable individual person, not necessarily named at the time of a license grant, regardless of\nwhether or not the individual is authorized by Licensee and actively Using the Software at any given time.\n2. EVALUATION SOFTWARE. If you have acquired the Software for evaluation, trial or beta purposes you are permitted to install\nand use one (1) copy of the Software for Non-Production evaluation purposes only for the limited time period as specified in the Order\nForm. If no time period is specified, your usage is limited to a thirty (30) day period, and the Software may contain an automatic\ndisabling mechanism that prevents use of the Software beyond the permitted evaluation period. THE SOFTWARE PROVIDED FOR\nEVALUATION PURPOSES IS PROVIDED “AS IS”, LICENSOR AND ITS RESPECTIVE EMPLOYEES, OFFICERS, DIRECTORS,\nCONTRACTORS, DISTRIBUTORS OR AGENTS, MAKE NO WARRANTIES OR REPRESENTATIONS, EXPRESSED OR IMPLIED,\nORAL OR IN WRITING, WITH RESPECT TO THE SOFTWARE PROVIDED FOR EVALUATION PURPOSES, INCLUDING ITS\nFITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY, DURABILITY, QUALITY OR ITS NON-INFRINGEMENT AND\nWILL NOT BE LIABLE FOR ANY DAMAGES, INCLUDING, BUT NOT LIMITED TO, DIRECT, INDIRECT, SPECIAL, INCIDENTAL,\nCONSEQUENTIAL OR PUNITIVE DAMAGES (INCLUDING LOST PROFITS AND LOST DATA) ARISING OUT OF THE USE OF OR\nTHE INABILITY TO USE THE SOFTWARE PROVIDED FOR EVALUATION PURPOSES.\n3. LICENSE GRANT.\na. Licenses Generally. Subject to the terms and conditions of this Agreement and your payment of all fees owing, from time\nto time, under this Agreement, including, but not limited to the applicable licensing restrictions set forth herein, and subject further to\nyour full compliance herewith and according to the scope, time period and other terms indicated on the applicable Order Form delivered\nin connection with this Agreement, Licensor hereby grants you and you hereby accept from Licensor, a non-exclusive, non-transferable\nand non-assignable (except as otherwise expressly provided in this Agreement) right and license to install, access and use the\nSoftware for your internal business operations in the territory set forth in the applicable Order Form in accordance with the number and\ntype of licenses set forth in the applicable Order Form. You hereby acknowledge that the licenses granted hereunder and the\nrestrictions applicable to your installation and use of the Software will vary according to the type of license purchased by you, as\nspecified in the applicable Order Form. You hereby agrees to the following license restrictions and conditions applicable to the Software\nset forth in the Order Forms delivered by you under this Agreement:\nb. Per Developer License. During the subscription Term, subject to the Order Form and your payment of annual license fees,\nLicensor grants you a non-transferable, non-sublicensable, non-exclusive, worldwide right and license for one (1) Developer to install\nand Use the specific version of the Software purchased on any number of Machines owned, controlled and used exclusively by the\nnamed Developer in order to create, develop and test Applications (the foregoing rights and license, a “Per Developer License”). To the\nextent that you have a valid license for Delphi, C++Builder or RAD Studio Pro or higher editions (collectively, “Pro User Licenses”),\nyou may use the Software with such Pro User Licenses to connect to remote databases located on a machine other than the machine\non which the your developed Applications are installed and the foregoing shall be deemed a limited waiver of the restrictions contained\nthe Section entitled “Additional License Terms Applicable to Rad Studio, Delphi And C++Builder, Professional, Professional with Mobile\nAnd Professional Academic Editions” in the end user license agreement for such Pro User License.\nc. Royalty-Free Distribution License. During the subscription Term, subject to the Order Form and your payment of annual\nsubscription license fees, Licensor grants you a non-transferable, non-sublicensable, non-exclusive, royalty-free right and license to\ndeploy and distribute Application(s) developed by or for you which use the Software as a run-time component without owing additional\nfees to Licensor, provided the Application(s): (A) contain no modifications to the Software (including alterations to the original\nproprietary notices); (B) are in compiled, executable form; (C) do not provide substantially the same functionality as the Licensed\nSoftware or have as one of their purposes to build other software that would compete with the Licensed Software; (D) do not reproduce\nor distribute any portion of the documentation for the Licensed Software or document the Application in a manner that identifies the\n\nPage 3 of 6\nVer. 081017ns\nprogrammatic interface to the callable routines in the Licensed Software; (E) are not a software development application that is sold\nprimarily to software developers or system integrators, or a development environment of any kind; and (F) are subject to a license\nagreement that (i) limits Application end-users use of the Software to a run-time component, (ii) restricts the Application end-user from\nchanging, altering or modifying the Software, creating derivative works, translations, reverse assembling, reverse compiling,\ndisassembling, or in any way reverse engineering the Software, and (iii) prevents the Application end-user from sublicensing, renting,\ndistributing, leasing or otherwise transferring or assigning any portion of the Software (the foregoing rights and license, a “Royalty-Free\nDistribution License”).\nd. Termination. Upon expiration or termination of this Agreement, whether by you or by Licensor and whether due to non-\npayment of renewal subscription license fees, breach of any term or condition or for convenience, you shall not be entitled to receive,\nand Licensor shall have no obligation to provide you with, Updates or New Releases and the Per Developer License shall terminate and\nyou shall have no right or license to create or modify any Applications; provided, however, that (i) the Royalty-Free Distribution License\nshall survive such termination, (ii) you may continue to distribute Applications created with the Software prior to such termination and\n(iii) any sublicenses to use the Software as a run-time component as part of your Application granted by you to your end users prior to\nexpiration or termination shall survive.\n4. BACK-UP AND DOCUMENTATION COPY. You may make a reasonable number of copies of the Software for Non-Production\npurposes provided you reproduce all copyright and other proprietary notices that are on the original copy of the Software. Further, you\nmay make a reasonable number of copies of the Software user documentation (i.e. manuals and installation guides) for your internal\nuse in accordance with this Agreement, provided that you reproduce all copyright and other proprietary notices that are on the original\ncopy of Software user documentation.\n5. LICENSE RESTRICTIONS. Licensor reserves all rights not expressly granted to you in this Agreement. Without limiting the\ngenerality of the foregoing, you acknowledge that the Software contains trade secrets and subject to applicable laws, you agree that\nyou will not: (a) copy the Software, except as permitted under this Agreement; (b) modify, adapt or translate the Software, except as\npermitted under this Agreement; (c) de-compile, reverse engineer or disassemble the Software or otherwise reduce the Software from\nobject code to source code; (d) use the Software to develop any works which are competitive to the Software; (e) lease, rent, loan, sell\nor distribute the Software to a third party (including, using the Software on a time-sharing basis, for service bureau purposes, or for the\nprovision of a fee generating service directly or indirectly to third parties) without the prior written agreement of Licensor; (f) except as\nexpressly permitted in this Agreement, assign or transfer your license rights to a third party or sub-license any or all of your license\nrights under this Agreement without the prior written agreement of Licensor; (g) combine the Software with any other software (including\nopen source software), where the combined software is subject to the GNU General Public License or any other license that requires\nthe combined program or the Software and its source code to be made freely available; (h) publicize or otherwise disclose any results\nof benchmark tests run on the Software; (i) You may not use multiplexing or pooling software or hardware that reduces the number\nof individual human beings directly accessing or utilizing the Software; and (j) the Software may not be used by your Affiliated parties\nunless specifically authorized in an Order Form.\n6. USE BY THIRD PARTIES. Licensor acknowledges and agrees that the Software may, subject to the terms of this Agreement,\nbe used by your third-party service providers, independent contractors, consultants and outsourcers, provided that such third parties\nagree to comply with the terms of this Agreement and such third parties Use the Software only for your benefit and business purposes.\nIf requested by Licensor, you will provide a list of any third parties that are using the Software pursuant to this Section to assist Licensor\nin managing the licensing of the Software. You will remain responsible and liable for the proper use of the Software in accordance with\nthis Agreement by such third parties.\n7. FEES. You agree to pay the applicable license fees for the Software and any applicable delivery charges, taxes, customs,\nduties or other governmental fees, relating to the license for the Software. Payment for all fees shall be due thirty (30) following receipt\nby Licensee of an invoice by Licensor specifying the amounts due, unless otherwise set forth in an Order Form accepted by Licensor.\nAll fees are nonrefundable. Any amounts not subject to a good faith dispute that are past due will incur interest at the highest rate then\npermitted by law. Additionally, Licensor may suspend Updates and support services until the undisputed portion of your account is\nbrought current. You are responsible for paying the full amount of fees to Licensor regardless of any taxes or bank transaction fees\nyou are required to pay. Unless timely provided with a valid certificate of exemption or other evidence that items are not taxable,\nLicensor will invoice you for all applicable taxes including, but not limited to, VAT, GST, sales tax, consumption tax and service tax. If\nany withholding tax is required by applicable law to be paid by you in relation to payments due to Licensor hereunder, you will provide\nLicensor with official receipts and/or certificates from the appropriate taxing authorities to establish that any applicable taxes have been\npaid.\n8. ELECTRONIC DELIVERY. All Licensor Material shall be delivered by Licensor to you via electronic delivery using a secure\ninternet download site. Ownership of all the licenses purchased hereunder and risk of loss for the related Licensor Materials shall be\ndeemed to have passed to Licensee on the date (the “Delivery Date”) that Licensor has made the Licensor Material available for\ndownload by Licensee, notified Licensee of the availability of the Licensor Material for download and provided Licensee with all license\nkeys, if any, necessary for the installation and operation of the Software.\n9. SOFTWARE SUPPORT, MAINTENANCE AND ENHANCEMENT. Support services for the Software and maintenance\nUpdates, including New Releases of the Software, are included in paid subscriptions during the subscription term. Licensor may\nprovide support directly or through its authorized agents, representatives, subcontractors or partners.\n10. VERIFICATION. You acknowledge and agree that Licensor may, upon reasonable notice to you, request records to verify your\nuse of the Software complies with the terms of this Agreement. In addition, Licensor may, at its expense, audit the number of copies of\nthe Software in use by Licensee and the Machines on which the Software is installed at any time during the subscription term. Any\n\nPage 4 of 6\nVer. 081017ns\nsuch audit shall be conducted during regular business hours at Licensee’s facilities and shall not unreasonably interfere with Licensee’s\nbusiness activities. If an audit reveals that Licensee has underpaid fees to Licensor, Licensee shall be invoiced for such underpaid fees\n(based on the list prices in effect at the time the audit is completed); and if the underpaid fees exceed 5% of the License fees already\npaid, then Licensee shall also pay Licensor the reasonable costs of conducting the audit.\n11. OWNERSHIP. The Software is licensed and not sold to you. Licensor or its third party licensors and suppliers shall at all times\nretain all right, title, and interest in the Software, Documentation, and Updates, including but not limited to any copies that You are\npermitted to make herein (“Licensor Materials”). All applicable common law and statutory rights in the Licensor Materials, including,\nbut not limited to, rights in confidential and trade secret material, source code, object code, Intellectual Property rights, trademarks,\nservice marks, patents, and copyrights, shall be and will remain the property of Licensor. You shall have no right, title, or interest in\nsuch proprietary rights except as provided in this Agreement. You recognize Licensor’s rights in the Licensor Materials and in the\nIntellectual Property rights therein and will not at any time knowingly bring such title or validity into issue or in any way impair the title of\nLicensor to any of such rights. By virtue of this Agreement, you acquire only the non–exclusive right to use the Licensor Materials and\ndo not acquire any rights of ownership to the Licensor Materials. Except for the license rights expressly granted herein, this Agreement\ngrants no additional express or implied license, right or interest in the Licensor Materials or other Intellectual Property rights of Licensor\nor its Affiliates. Licensor reserves all rights not expressly granted to Licensee in this Agreement. You are responsible for any copyright\ninfringement that is caused by you or any of your contractors. Licensee agrees that Licensor's third party licensors and suppliers are\nintended third party beneficiaries of all terms and conditions of this Agreement intended to protect intellectual property rights in the\nSoftware.\n12. TERM OF LICENSE; TERMINATION. The term of each subscription license shall be twelve months from the Delivery Date\nunless the Order Form states otherwise and the license for the Software and this Agreement will terminate at the end of the\nsubscription term unless it is renewed. Each subsequent annual renewal subscription term will start on the day following the expiration\nof the previous subscription term regardless of the actual subscription renewal date. The subscription term and each renewal thereof is\nreferred to herein collectively as the “Term.” You may terminate this Agreement at any time by providing written notice to Licensor,\nhowever, you will remain liable for the full amount of license fees for the entire subscription term and you will not receive a refund of any\nfees paid. If at any time you fail to make timely payment of any applicable fees due in respect of Software licensed or maintenance\nservice or use the Software in excess of the number of licenses purchased or violate any term or condition contained herein, then\nLicensor may, in addition to any other remedy to which it may be entitled, terminate your license to the Software and any rights you may\nhave to maintenance services. Either party may terminate this Agreement, effective immediately upon written notice, if the other party\nbecomes the subject of a voluntary or involuntary petition in bankruptcy or any proceeding relating to insolvency, receivership,\nliquidation or composition for the benefit of creditors, if that petition or proceeding is not dismissed with prejudice within sixty (60) days\nafter filing. If Your license term expires without renewal or reinstatement or otherwise terminates, then You shall promptly destroy or\nreturn to Licensor all copies of the Software and related documentation in your possession or control. If Licensor is terminating the\nlicense for cause, and you have acquired a subscription license, you remain liable for all unpaid subscription fees that are payable for\nthe entire subscription period. Within thirty (30) days following any expiration or termination, an authorized signatory of your\norganization will certify in writing to Licensor that the original and all copies of the Software have been destroyed or returned to\nLicensor. The provisions of Sections 1 (Defined Terms), 7 (Fees) for so long as any fees are due to Licensor, 10 (Verification), 11\n(Ownership), 12 (Term of License; Termination), 13 (Indemnification), 14 (Disclaimer of Warranty), 15 (Limitation of Liability), 16\n(General).\n13. INDEMNIFICATION. You agree to defend, indemnify and hold harmless Licensor, its suppliers and its Authorized Partners from\nand against liabilities, costs, damages and expenses (including settlement costs and reasonable attorney fees) arising from any claims\nfrom anybody that result from or relate to you and your contractor’s use, reproduction or distribution of the Software or any permitted\nApplications herein.\n14. DISCLAIMER OF WARRANTY. THE SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND,\nINCLUDING BUT NOT LIMITED TO THE IMPLIED WARRANTIES OF MERCHANTABILITY, NON-INFRINGEMENT AND FITNESS\nFOR A PARTICULAR PURPOSE. FURTHER, LICENSOR SPECIFICALLY DOES NOT WARRANT, GUARANTEE, OR MAKE ANY\nREPRESENTATIONS REGARDING THE USE, OR THE RESULTS OF THE USE OF THE SOFTWARE IN TERMS OF\nCORRECTNESS, ACCURACY, RELIABILITY, CURRENTNESS, OR OTHERWISE. NO ORAL OR WRITTEN INFORMATION OR\nADVICE GIVEN BY LICENSOR OR ITS EMPLOYEES SHALL CREATE A WARRANTY OR IN ANY WAY INCREASE THE SCOPE\nOF THIS WARRANTY, AND LICENSEE MAY NOT RELY ON ANY SUCH INFORMATION OR ADVICE. FURTHER, THE\nSOFTWARE IS NOT FAULT-TOLERANT AND IS NOT DESIGNED, MANUFACTURED OR INTENDED FOR USE OR RESALE AS\nON-LINE CONTROL EQUIPMENT IN HAZARDOUS ENVIRONMENTS REQUIRING FAIL-SAFE PERFORMANCE, SUCH AS IN\nTHE OPERATION OF NUCLEAR FACILITIES, AIRCRAFT NAVIGATION OR COMMUNICATION SYSTEMS, AIR TRAFFIC\nCONTROL, DIRECT LIFE SUPPORT MACHINES, OR WEAPONS SYSTEMS, IN WHICH THE FAILURE OF THE SOFTWARE\nCOULD LEAD DIRECTLY TO DEATH, PERSONAL INJURY, OR SEVERE PHYSICAL OR ENVIRONMENTAL DAMAGE (\"HIGH\nRISK ACTIVITIES\"). LICENSOR AND ITS LICENSOR SPECIFICALLY DISCLAIM ANY EXPRESS OR IMPLIED WARRANTY OF\nFITNESS FOR HIGH RISK ACTIVITIES. If a jurisdiction applicable to this Agreement restricts the exclusion of certain implied\nwarranties, limitations on how long an implied warranty may last, or the exclusion or limitation of incidental, consequential, or special\ndamages: (A) each warranty which cannot be excluded is limited in time to sixty (60) days from the date of Delivery; and (B) Licensor's\ntotal liability to Licensee for breach of all such warranties are limited to the amount stated in Section 14 (Limitation on Liability).\n15. LIMITATION OF LIABILITY. T O THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT WILL\nLICENSOR'S TOTAL AGGREGATE AND CUMULATIVE LIABILITY (IF ANY) TO YOU FOR ANY AND ALL CLAIMS OF ANY KIND\nARISING HEREUNDER EXCEED THE AMOUNT OF LICENSE FEES ACTUALLY PAID BY YOU FOR THE SOFTWARE GIVING\nRISE TO THE CLAIM IN THE TWELVE MONTHS PRECEDING THE CLAIM. LICENSOR'S AND THEIR SUPPLIERS SHALL HAVE\n\nPage 5 of 6\nVer. 081017ns\nNO LIABILITY TO YOU FOR ANY DAMAGES SUFFERED BY YOU OR ANY THIRD PARTY AS A RESULT OF USING THE\nSOFTWARE. NOTWITHSTANDING THE FOREGOING, IN NO EVENT SHALL LICENSOR, OR ANY OF ITS RESPECTIVE\nSUPPLIERS BE LIABLE FOR ANY LOST SALES, LOST REVENUE, LOST PROFITS, LOST OR CORRUPTED DATA, OR\nREPROCUREMENT AMOUNT OR FOR INDIRECT, PUNITIVE, AGGRAVATED, EXEMPLARY, SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES OF ANY CHARACTER, INCLUDING, WITHOUT LIMITATION, ANY COMMERCIAL DAMAGES OR\nLOSSES, HOWEVER CAUSED AND REGARDLESS OF THE THEORY OF LIABILITY, ARISING OUT OF THE USE OR INABILITY\nTO USE THE SOFTWARE, EVEN IF LICENSOR AND/OR ANY OF ITS RESPECTIVE SUPPLIERS HAVE BEEN INFORMED OF\nTHE POSSIBILITY OF SUCH DAMAGES. EACH EXCLUSION OR LIMITATION IS INTENDED TO BE A SEPARATE AND\nTHEREFORE SEVERABLE EXCLUSION. The parties agree that the limitations specified in this Section 14 will survive and apply even\nif any limited remedy specified in this Agreement is found to have failed of its essential purpose. The provisions of this Agreement\nallocate the risks between Licensor and you. The fees reflect this allocation of risk and the limitations of liability herein.\n16. GENERAL.\n(A) Each Party shall comply with all laws applicable to the actions contemplated by this EULA. You acknowledge that the\nSoftware is of United States origin, is provided subject to the U.S. Export Administration Regulations, may be subject to the export\ncontrol laws of the applicable territory, and that diversion contrary to applicable export control laws is prohibited. you represent that (i)\nyou are not, and are not acting on behalf of, (a) any person who is a citizen, national, or resident of, or who is controlled by the\ngovernment of any country to which the United States has prohibited export transactions; or (b) any person or entity listed on the U.S.\nTreasury Department list of Specially Designated Nationals and Blocked Persons, or the U.S. Commerce Department Denied Persons\nList or Entity List; and (ii) you will not permit the Software to be used for, any purposes prohibited by law, including, any prohibited\ndevelopment, design, manufacture or production of missiles or nuclear, chemical or biological weapons.\n(B) The Software is deemed to be “commercial computer software” and “commercial computer software documentation”,\nrespectively, pursuant to DFAR Section 227.7202 and FAR Section 12.212(b), as applicable. Any use, modification, reproduction,\nrelease, performing, displaying or disclosing of the Software by the U.S. Government shall be governed solely by the terms and\nconditions of this EULA. However, the terms and conditions of this Agreement shall not apply to any agency procuring this Software on\nbehalf of the U.S. Government solely for the U.S. Government’s use.\n(C) This Agreement is personal to you. You may not transfer, assign or otherwise convey, novate or encumber this Agreement\nor the Software, in whole or in part, to any other party, including any parent, subsidiary or affiliated entity, whether through a Change of\nControl which is voluntary or involuntary, by Merger, consolidation, dissolution, operation of law, or any other manner without Licensor’s\nexpress written consent. For purposes of this Section 16(C), (i) a “Change of Control” shall include, but not be limited to, any merger,\nconsolidation, amalgamation, reorganization or sale, transfer or exchange of the capital stock or equity interests of Licensee in a\ntransaction or series of transactions which results in the holders of Licensee’s capital stock or equity interests holding less than fifty\npercent (50%) of the outstanding capital stock or equity interests immediately following such transaction(s); and (ii) “Merger” refers to\nany merger in which the Licensee participates, regardless of whether it is the surviving or disappearing entity. Further, you may not\ndelegate any performance under this Agreement without Licensor’s express written consent. Any purported assignment of rights or\ndelegation of performance in violation of this Section 16(C) is void. Licensor may assign its rights and obligations under this Agreement\n(in whole or in part) without your consent.\n(D) Any amendment of this EULA must be in writing and signed by both parties. Neither party will be deemed to have waived\nany of its rights under this EULA by lapse of time or by any statement or representation other than by a written waiver by a duly\nauthorized representative. No waiver of a breach of this EULA will constitute a waiver of any prior or subsequent breach of this\nEULA.\n(E) This EULA, and all disputes arising out of or relating to this EULA, shall be governed by, and construed and interpreted in\naccordance with, the laws of the State of Texas excluding (i) its conflicts or choice of law rules; (ii) the United Nations Convention on\nContracts for the International Sale of Goods; and (iii) the Uniform Computer Information Transactions Act, or any version, adopted by\nany state. Except for a request for injunctive or other equitable relief, any dispute arising out of this EULA will be subject to the\nexclusive jurisdiction of the courts located in Travis County, Texas.\n(F) Neither Party will be responsible for any failure or delay in its performance under this EULA due to causes beyond its\nreasonable control, including, but not limited to, general strikes or lockouts, shortages of or inability to obtain labor, energy, raw\nmaterials or supplies, war, terrorism, riot, natural disasters or governmental action.\n(G) If any provision of this EULA is deemed contrary to applicable law or unenforceable by a court of competent\njurisdiction, the provision will be severed from the EULA and all remaining provisions will continue in full force.\n(H) This EULA including any website links, exhibits, and Order Forms is the complete and exclusive statement of the mutual\nunderstanding of the parties and supersedes and cancels all previous written and oral agreements and communications relating to the\nsubject matter of this Agreement. No provision of any sales order, purchase order or other business form, including any electronic\ninvoicing portals and vendor registration processes, employed by you will supersede the terms and conditions of this EULA, and any\nsuch document shall be for administrative purposes only and shall have no legal effect. Notwithstanding the foregoing, Licensor may,\nfrom time to time, update the Licensor EULA with new releases of the Software. The version of the Licensor EULA that applies to you is\nthe version that is contained in the Software you are currently using.\n(I) Any and all notices, requests, demands and other communications required or otherwise contemplated to be made under this\nEULA shall be in writing and in English and shall be deemed to have been duly given (i) if delivered personally, when received; (ii) if\ntransmitted by facsimile, upon receipt of a transmittal confirmation; (iii) if sent by certified mail, return receipt requested, postage\n\nPage 6 of 6\nVer. 081017ns\nprepaid, on the date indicated on the return receipt; (iv) if by international courier service, on the delivery date as may be confirmed to\nthe sender by such courier service; or (v) if by E-mail, when the recipient, by an E-mail sent to the E-mail address for the sender as\nspecified on the Order Form or by a notice delivered by another method in accordance with this section, acknowledges having received\nthat E-mail, with an automatic “read receipt” not constituting acknowledgment of an E-mail for purposes of this section. All such\nnotices, requests, demands and other communications shall be addressed as specified on the Order Form.\n(J) You agree that Licensor may collect, maintain, process and use diagnostic, technical and related information, including non-\npersonal information related to your device, computer, system, application software, or peripherals and personal information relating to\nthe geographic location and IP address from you access or install the Software, in each case as such information is necessary or\nexpedient to facilitate the provision of Software Updates, product support and/or compliance verification, and otherwise to improve the\nSoftware and other software products and delivery of related services.\n(K) The Software may be used by you to connect to or integrate with technology owned or controlled by a person or entity other\nthan Licensor and such activity may subject you to a service or license agreement with such person or entity. You agree to look solely\nto such third party with respect to any such service or license agreement.\n(L) Regardless of any language into which this Agreement may be translated, the official, controlling and governing version of\nthis Agreement shall be exclusively the English language version.\n(M) You agree that Licensor can use the information provided during the purchase of the Software to deliver and confirm your\npurchase or for other relevant purposes, as well as contact you again about other products, services, or offers.\n[END OF AGREEMENT]"
}